---
type: IntersectionResult
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# IntersectionResult

`Autodesk.Revit.DB.IntersectionResult` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IntersectionResult | — | `public IntersectionResult ()` |
| Property | Distance | — | `public double Distance { get ; internal set ; }` |
| Property | EdgeObject | — | `public Edge EdgeObject { get ; internal set ; }` |
| Property | EdgeParameter | — | `public double EdgeParameter { get ; internal set ; }` |
| Property | Parameter | — | `public double Parameter { get ; internal set ; }` |
| Property | UVPoint | — | `public UV UVPoint { get ; internal set ; }` |
| Property | XYZPoint | — | `public XYZ XYZPoint { get ; internal set ; }` |